АвтосервисАвтомагазин/src/InformationRegisters/АС2_ЗагрузкаРесурсов/АС2_ЗагрузкаРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АС2_ЗагрузкаРесурсов</name>
  <resources>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.АС2_АвтомобилиКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусЗаказаКлиента</name>
    <type>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
    </type>
  </resources>
  <attributes>
    <name>ИмяОбласти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВРаботе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.АС2_Ресурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АвтосервисАвтомагазин/src/InformationRegisters/АС2_ЗагрузкаРесурсов/ManagerModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает строку из имен реквизитов регистра через запятую
// 
// Возвращаемое значение:
//  Строка - Структура реквизитов
Функция СтруктураРеквизитов() Экспорт

	НаборРеквизитов = Новый Массив;
	КоллекцияКлассов = Новый Массив;

	МетаданныеРегистра = Метаданные.РегистрыСведений.АС2_ЗагрузкаРесурсов;

	КоллекцияКлассов.Добавить(МетаданныеРегистра.Измерения);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.Ресурсы);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.Реквизиты);
	КоллекцияКлассов.Добавить(МетаданныеРегистра.СтандартныеРеквизиты);

	Для Каждого Раздел Из КоллекцияКлассов Цикл
		Для Каждого Реквизит Из Раздел Цикл
			НаборРеквизитов.Добавить(Реквизит.Имя);
		КонецЦикла;
	КонецЦикла;

	Возврат СтрСоединить(НаборРеквизитов, ",");

КонецФункции

Функция КоллекцияРаботНаДату(Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	АС2_ЗагрузкаРесурсов.Ресурс КАК Ресурс,
				   |	АС2_ЗагрузкаРесурсов.ЗаказКлиента КАК ЗаказКлиента,
				   |	АС2_ЗагрузкаРесурсов.Начало КАК Начало,
				   |	АС2_ЗагрузкаРесурсов.Окончание КАК Окончание,
				   |	АС2_ЗагрузкаРесурсов.Автомобиль КАК Автомобиль,
				   |	АС2_ЗагрузкаРесурсов.Комментарий КАК Комментарий,
				   |	АС2_ЗагрузкаРесурсов.Идентификатор КАК Идентификатор,
				   |	АС2_ЗагрузкаРесурсов.ВРаботе КАК ВРаботе
				   |ИЗ
				   |	РегистрСведений.АС2_ЗагрузкаРесурсов КАК АС2_ЗагрузкаРесурсов
				   |ГДЕ
				   |	(НАЧАЛОПЕРИОДА(АС2_ЗагрузкаРесурсов.Начало, ДЕНЬ) = &АктуальнаяДата
				   |	ИЛИ НАЧАЛОПЕРИОДА(АС2_ЗагрузкаРесурсов.Окончание, ДЕНЬ) = &АктуальнаяДата)";
	Запрос.УстановитьПараметр("АктуальнаяДата", Дата);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
